Revit 2024 API
ExternalResourceBrowserData.GetResources Method
 Gets the external resources under the folder path of the browser data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<ExternalResourceReference> GetResources()
Visual Basic
Public Function GetResources As IList(Of ExternalResourceReference)
Visual C++
public:
IList<ExternalResourceReference^>^ GetResources()
Return Value
 The external resources under current folder of the browser data.
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace